pkg/tenantbillingserver/stripe/testdata/recurring/customer.json

{
  "id": "cus_G7JW3JDioJTVcq",
  "object": "customer",
  "account_balance": 0,
  "address": null,
  "balance": 0,
  "created": 1572871345,
  "currency": "eur",
  "default_source": null,
  "delinquent": false,
  "description": null,
  "discount": null,
  "email": "testclient1@example.com",
  "invoice_prefix": "C1401CCE",
  "invoice_settings": {
    "custom_fields": null,
    "default_payment_method": null,
    "footer": null
  },
  "livemode": false,
  "metadata": {
  },
  "name": "TestClient1",
  "phone": null,
  "preferred_locales": [

  ],
  "shipping": {
    "address": {
      "city": "",
      "country": "",
      "line1": "",
      "line2": "",
      "postal_code": "",
      "state": ""
    },
    "name": "TestClient1",
    "phone": ""
  },
  "sources": {
    "object": "list",
    "data": [

    ],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/customers/cus_G7JW3JDioJTVcq/sources"
  },
  "subscriptions": {
    "object": "list",
    "data": [
      {
        "id": "sub_G7JkQ5ATNZKicE",
        "object": "subscription",
        "application_fee_percent": null,
        "billing": "send_invoice",
        "billing_cycle_anchor": 1572872207,
        "billing_thresholds": null,
        "cancel_at": null,
        "cancel_at_period_end": false,
        "canceled_at": null,
        "collection_method": "send_invoice",
        "created": 1572872207,
        "current_period_end": 1575464207,
        "current_period_start": 1572872207,
        "customer": "cus_G7JW3JDioJTVcq",
        "days_until_due": 30,
        "default_payment_method": null,
        "default_source": null,
        "default_tax_rates": [

        ],
        "discount": null,
        "ended_at": null,
        "invoice_customer_balance_settings": {
          "consume_applied_balance_on_void": true
        },
        "items": {
          "object": "list",
          "data": [
            {
              "id": "si_G7JkZJycqfND0i",
              "object": "subscription_item",
              "billing_thresholds": null,
              "created": 1572872207,
              "metadata": {
              },
              "plan": {
                "id": "plan_G6CmtjyI1lsDhn",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": 5500,
                "amount_decimal": "5500",
                "billing_scheme": "per_unit",
                "created": 1572615671,
                "currency": "eur",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {
                  "max-applications": "123",
                  "max-clients": "124",
                  "max-end-devices": "125",
                  "max-gateways": "126",
                  "max-organizations": "127",
                  "max-users": "128"
                },
                "nickname": "Recurring",
                "product": "prod_FyGd9sqdXAw0Ha",
                "tiers": null,
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "quantity": 1,
              "subscription": "sub_G7JkQ5ATNZKicE",
              "tax_rates": [

              ]
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/subscription_items?subscription=sub_G7JkQ5ATNZKicE"
        },
        "latest_invoice": "in_1Fb56xHOAFOdjMkEpxWS2xTf",
        "livemode": false,
        "metadata": {
          "tenant-id": "testclient1"
        },
        "next_pending_invoice_item_invoice": null,
        "pending_invoice_item_interval": null,
        "pending_setup_intent": null,
        "plan": {
          "id": "plan_G6CmtjyI1lsDhn",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 5500,
          "amount_decimal": "5500",
          "billing_scheme": "per_unit",
          "created": 1572615671,
          "currency": "eur",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {
            "max-applications": "123",
            "max-clients": "124",
            "max-end-devices": "125",
            "max-gateways": "126",
            "max-organizations": "127",
            "max-users": "128"
          },
          "nickname": "Recurring",
          "product": "prod_FyGd9sqdXAw0Ha",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "schedule": null,
        "start": 1572872207,
        "start_date": 1572872207,
        "status": "active",
        "tax_percent": null,
        "trial_end": null,
        "trial_start": null
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/customers/cus_G7JW3JDioJTVcq/subscriptions"
  },
  "tax_exempt": "none",
  "tax_ids": {
    "object": "list",
    "data": [

    ],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/customers/cus_G7JW3JDioJTVcq/tax_ids"
  },
  "tax_info": null,
  "tax_info_verification": null
}
